""" 4. Створіть функцію <morse_code>, яка приймає на вхід рядок у вигляді коду Морзе та виводить декодоване значення 
(латинськими літерами).
   Особливості:
    - використовуються лише крапки, тире і пробіли (.- )
    - один пробіл означає нову літеру
    - три пробіли означають нове слово
    - результат може бути case-insensetive (на ваш розсуд - велики чи маленькими літерами).
    - для простоти реалізації - цифри, знаки пунктуацїї, дужки, лапки тощо використовуватися не будуть. 
    Лише латинські літери.
    - додайте можливість декодування сервісного сигналу SOS (...---...)
    Приклад:
    --. . . -.- .... ..- -...   .. ...   .... . .-. .
    результат: GEEKHUB IS HERE
    """

MORSE_DICT = {".-": "A", "-...": "B", "-.-.": "C", "-..": "D", ".": "E",
              "..-.": "F", "--.": "G", "....": "H", "..": "I", ".---": "J", "-.-": "K",
              ".-..": "L", "--": "M", "-.": "N", "---": "O", ".--.": "P", "--.-": "Q",
              ".-.": "R", "...": "S", "-": "T", "..-": "U", "...-": "V", ".--": "W",
              "-..-": "X", "-.--": "Y", "--..": "Z", "...---...": "SOS"}


def morse_code(code):
    decrypted_str = ""
    words_from_code = code.split("   ")
    for word in words_from_code:
        chars_from_word = word.split(" ")
        for char in chars_from_word:
            if char in MORSE_DICT:
                decrypted_str += MORSE_DICT[char]
        decrypted_str += " "
    return f"Result: {decrypted_str}"


if __name__ == "__main__":
    # code = "--. . . -.- .... ..- -...   .. ...   .... . .-. .   ...---..."
    code = input("Please enter morse code: ")
    print(morse_code(code))
